<html>
<head>
 <title> HTML </title>
</head>
<body bgcolor="GreenYellow"text="MediumVioletRed" leftmargin="10%"topmargin="40" >
 <h1><b><p align="center">Limbajul de marcare HTML</p></b> </h1>
 <h2><p style="text-align:left"><pre><font face="TimesNewRoman" size="6">	<b>HTML (Hypertext Markup Language)</b> este un limbaj de marcare care st&#259; la baza dezvolt&#259;rii
oric&#259;rei pagini Web. Limbajul HTML const&#259; &#238;ntr-o serie de etichete numite si tag- uri care permit
formatarea modului de afi&#351;are a informatiei din pagina Web (folosirea unor anumite font-uri, culori &#351;i stiluri
pentru text, inserarea unor imagini sau a unor tabele, utilizarea listelor si a formularelor etc.).
	Tag-urile HTML sunt incluse &#238;ntre paranteze ascu&#355;ite <>, majoritatea dintre ele fiind &#238;n pereche,
tag-ul de &#238;nceput avand sintaxa <..> iar tag-ul de &#351;f&#226;rsit </..>. Unele dintre tag-urile HTML permit
precizarea unor caracteristici ale elementului pe care &#238;l introduc, sub forma caracteristic&#259;=valoare, aceste
caracteristici fiind numite atribute. O etichet&#259; poate avea unul, nici unul, sau mai multe atribute.
	Con&#355;inutul unui document HTML nu este case-sensitive, cu alte cuvinte nu se face diferen&#355;a &#238;ntre
litere mari &#351;i mici la nivelul etichetelor &#351;i atributelor, &#238;nsa valoarea unui atribut poate fi case-sensitive, cum
este cazul loca&#355;iilor fi&#351;ierelor &#351;i adreselor URL.</font></pre><p><h2>
<hr width=”100%” size=”2” align=”right”>
<font color="blue" face="TimesNewRoman">
<pre><p style="text-align:right"><font color="blue" face="TimesNewRoman" size="6"> 	Un document HTML este un fi&#351;ier care are extensia .htm sau .html. Pentru editarea textului unui
document HTML pot fi folosite orice tipuri de editoare, &#238;ncep&#226;nd cu editoare simple cum ar fi Notepad,
	Textpad si ajung&#226;nd la editoare mai complexe cum ar fi Macromedia Dreamweaver.</font></p></pre>
<hr width=”100%” size=”2” align=”right”>
<pre><font face="TimesNewRoman" color="MediumVioletRed" size="6"><p style="text-align:left">		Doua dintre tr&#259;saturile de baz&#259; ale unui document HTML sunt independen&#355;a fa&#355;&#259; de platform&#259; &#351;i
leg&#259;turile hypertext (hyperlink-uri).
	Independen&#355;a fat&#259; de platform&#259; este o tr&#259;satur&#259; care permite ca documentul HTML s&#259; fie afi&#351;at &#238;n
mod asem&#259;n&#259;tor pe diferite calculatoare din punct de vedere al graficii, fontului, culorii, lucru extrem de
esen&#355;ial pentru un num&#259;r mare de vizitatori. Totu&#351;i, interpretarea codului HTML poate sa fie diferit&#259; &#238;n
func&#355;ie de tipul de browser Web utilizat. Astfel un document HTML poate fi afi&#351;at de c&#259;tre un browser
Internet Explorer &#238;ntr-un anumit fel, iar de c&#259;tre alt browser (spre exemplu Mozilla Firefox) &#238;n alt fel.
	<u>Hyperlink-urile au o importan&#355;&#259; major&#259; &#238;n cadrul unui site Web</u>, intruc&#226;t permit ca orice cuv&#226;nt,
fraz&#259;, imagine sau element al unei pagini Web s&#259; fac&#259; referire la o alt&#259; pagin&#259; Web sau chiar la paragrafe
din interiorul aceleiasi pagini, realiz&#226;ndu-se astfel navigarea cu u&#351;urin&#355;a &#238;ntre paginile unui site Web sau
&#238;ntre p&#259;r&#355;ile componente ale aceleiasi pagini.</p>
</font>
</pre>

</body>
</html>
